# DT_AssociateWithObj

## Description
Returns TRUE if associating is successful.

```pascal
FUNCTION DT_AssociateWithObj(
				hDataTag : HANDLE;
				hObject  : HANDLE) : BOOLEAN;
```

```python

def vs.DT_AssociateWithObj(hDataTag, hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hDataTag|HANDLE||
|hObject|HANDLE||

## Version
Availability: from Vectorworks 2020
## Category
* Data Tag Interface Library